[S2]
影=邪恶小法师,涤魂圣枪,永猎双子,虚空先知,无极剑圣,亡灵战神
游侠=暗夜猎手,永猎双子,惩戒之箭,寒冰射手,探险家,瘟疫之源
掠食者=虚空遁地兽,深渊巨口,祖安怒兽,水晶先锋
水晶=水晶先锋,寒冰射手,瓦洛兰之盾
剧毒=深渊巨口,祖安狂人,瘟疫之源,炼金术士
森林=万花通灵,扭曲树精,翠神,诡术妖姬
德鲁伊=万花通灵,扭曲树精,翠神
天启者=天启者
卢锡安=卢锡安
[S3]
未来战士=布里茨,凯特琳,崔斯特,慎,伊泽瑞尔,孙悟空,锤石
源计划=艾瑞莉娅,菲奥娜,蕾欧娜,卢锡安,蔚,艾克
宇宙海盗=格雷福斯,德莱厄斯,杰斯,普朗克
暗星=嘉文四世,莫德凯撒,卡尔玛,拉克丝,萨科,烬
虚空=卡兹克,科加斯,维克兹
奥德赛=墨菲特,吉格斯,娑娜,亚索,易,金克丝,龙王
星之守护者=波比,佐伊,阿狸,妮蔻,辛德拉,索拉卡
星神=霞,洛,赵信,艾希,卡萨丁,璐璐
银河魔装机甲=菲兹,安妮,兰博
女武神=卡莎,凯尔,厄运小姐
刺客=卡兹克,卡莎,萨科,菲兹,艾克
狙神=凯特琳,艾希,烬
强袭枪手=格雷福斯,卢锡安,伊泽瑞尔,金克丝,厄运小姐
圣盾使=嘉文四世,赵信,妮蔻,洛
重装战士=蕾欧娜,波比,莫德凯撒,杰斯,孙悟空
斗士=墨菲特,布里茨,蔚,科加斯
法师=崔斯特,佐伊,阿狸,安妮,拉克丝,辛德拉,维克兹
剑士=霞,慎,亚索,易,艾瑞莉娅,凯尔,菲奥娜
爆破专家=吉格斯,兰博,普朗克
破法战士=德莱厄斯,卡萨丁,艾瑞莉娅,锤石
秘术=娑娜,卡尔玛,索拉卡,璐璐
佣兵=普朗克,厄运小姐
星际战舰=龙王
